local function custom_startup()
  local stats = require("lazy").stats()
  local ms = (math.floor(stats.startuptime * 100 + 0.5) / 100)

  return {
    text = {
      {
        ("⚡ GNU / Emacs unleashed %d/%d plugins in %sms!"):format(stats.loaded, stats.count, ms),
        hl = "SnacksDashboardDesc",
        align = "center",
      },
    },
  }
end

return {

  "folke/snacks.nvim",

  opts = {

    dashboard = {

      preset = {

        header = [[
 ██████╗ ███╗   ██╗██╗   ██╗        ██╗    ███████╗███╗   ███╗ █████╗  ██████╗███████╗
██╔════╝ ████╗  ██║██║   ██║       ██╔╝    ██╔════╝████╗ ████║██╔══██╗██╔════╝██╔════╝
██║  ███╗██╔██╗ ██║██║   ██║      ██╔╝     █████╗  ██╔████╔██║███████║██║     ███████╗
██║   ██║██║╚██╗██║██║   ██║     ██╔╝      ██╔══╝  ██║╚██╔╝██║██╔══██║██║     ╚════██║
╚██████╔╝██║ ╚████║╚██████╔╝    ██╔╝       ███████╗██║ ╚═╝ ██║██║  ██║╚██████╗███████║
 ╚═════╝ ╚═╝  ╚═══╝ ╚═════╝     ╚═╝        ╚══════╝╚═╝     ╚═╝╚═╝  ╚═╝ ╚═════╝╚══════╝
      ]],
      },
      sections = {
        { section = "header" },
        { section = "keys", gap = 1, padding = 1 },
        custom_startup, -- use your custom function
      },
    },
  },
}
